{
  "gameData": [
    {
      "name": " การแยกตัวประกอบจำนวนเต็ม (1)",
      "des": "ให้ผู้เล่นสร้างสี่เหลี่ยมผืนผ้าที่มีพื้นที่เท่ากับตัวเลขด้านซ้าย โดยสังเกตว่าความกว้างและความยาวที่ได้ของสี่เหลี่ยมผืนผ้าคือเท่าใด",
      "img": "img/debug.png",
      "gif": "./video/spol-1.mp4",
      "playLink": "https://meangpu.github.io/SPOLS/level1/"
    },
    {
      "name": "การแยกตัวประกอบจำนวนเต็ม (2)",
      "des": "ให้ผู้เล่นสร้างสี่เหลี่ยมผืนผ้าที่มีพื้นที่เท่ากับเลขบนกล่องตามสีที่อยู่ในกล่องที่ตกลงมา โดยสี่เหลี่ยมที่ผู้เล่นสร้างต้องอยู่ติดกัน และมีขนาดความกว้างหรือความสูงเท่ากัน",
      "img": "img/debug.png",
      "gif": "./video/spol-2.mp4",
      "playLink": "https://meangpu.github.io/SPOLS/level2/"
    },
    {
      "name": " การแยกตัวประกอบจำนวนเต็ม (3)",
      "des": "ให้ผู้เล่นประกอบสี่เหลี่ยมผืนผ้าโดยใช้สี่เหลี่ยม 3 ชนิด สีฟ้าขนาด NxN สีเขียวขนาด N และสีเหลืองขนาด 1 มาต่อกันให้เป็นสี่เหลี่ยมผื่นผ้าใหญ่ผืนเดียวตามในวีดีโอ",
      "img": "img/debug.png",
      "gif": "./video/spol-3.mp4",
      "playLink": "https://meangpu.github.io/SPOLS/level3/"
    },
    {
      "name": " การแยกตัวประกอบของพหุนามดีกรีสองตัวแปรเดียว 1",
      "des": "ให้ผู้เล่นประกอบสี่เหลี่ยมผืนผ้าโดยใช้สี่เหลี่ยม 3 ชนิด สีฟ้าขนาด NxN สีเขียวขนาด N  และสีเหลืองขนาด 1 มาต่อกันให้เป็นสี่เหลี่ยมผื่นผ้าใหญ่ผืนเดียวตามในวีดีโอ",
      "img": "img/debug.png",
      "gif": "./video/spol-4.mp4",
      "playLink": "https://meangpu.github.io/SPOLS/level4/"
    },
    {
      "name": "การแยกตัวประกอบของพหุนามดีกรีสองตัวแปรเดียว 2",
      "des": "ให้ผู้เล่นประกอบสี่เหลี่ยมผืนผ้าโดยใช้สี่เหลี่ยม 4 ชนิด สีฟ้าขนาด NxN สีเขียวขนาด N สีแดงขนาด -N และสีเหลืองขนาด 1 และ -1 มาต่อกันให้เป็นสี่เหลี่ยมผื่นผ้าใหญ่ผืนเดียวตามในวีดีโอ",
      "img": "img/debug.png",
      "gif": "./video/spol-5.mp4",
      "playLink": "https://meangpu.github.io/SPOLS/level5/"
    },
    {
      "name": "การแยกตัวประกอบของพหุนามดีกรีสองตัวแปรเดียว 3",
      "des": "ให้ผู้เล่นประกอบสี่เหลี่ยมผืนผ้าโดยใช้สี่เหลี่ยม 4 ชนิด สีฟ้าขนาด NxN สีเขียวขนาด N สีแดงขนาด -N และสีเหลืองขนาด 1 และ -1 มาต่อกันให้เป็นสี่เหลี่ยมผื่นผ้าใหญ่ผืนเดียวตามในวีดีโอ",
      "img": "img/debug.png",
      "gif": "./video/spol-6.mp4",
      "playLink": "https://meangpu.github.io/SPOLS/level6/"
    },
    {
      "name": "การแยกตัวประกอบของพหุนามดีกรีสองตัวแปรเดียวแบบกำลังสองสมบูรณ์",
      "des": "ให้ผู้เล่นประกอบสี่เหลี่ยมโดยใช้สี่เหลี่ยม 4 ชนิด สีฟ้าขนาด NxN สีเขียวขนาด N สีแดงขนาด -N และสีเหลืองขนาด 1 และ -1 มาต่อกันให้เป็นสี่เหลี่ยม่ผืนเดียวตามในวีดีโอ",
      "img": "img/debug.png",
      "gif": "./video/spol-7.mp4",
      "playLink": "https://meangpu.github.io/SPOLS/level7/"
    },
    {
      "name": "การแยกตัวประกอบของพหุนามดีกรีสองที่เป็นผลต่างกำลังสอง",
      "des": "ให้ผู้เล่นประกอบสี่เหลี่ยมโดยใช้สี่เหลี่ยม 4 ชนิด สีฟ้าขนาด NxN สีเขียวขนาด N สีแดงขนาด -N และสีเหลืองขนาด 1 และ -1 มาต่อกันให้เป็นสี่เหลี่ยมผืนเดียวตามในวีดีโอ",
      "img": "img/debug.png",
      "gif": "./video/spol-8.mp4",
      "playLink": "https://meangpu.github.io/SPOLS/level8/"
    }
  ]
}
